#+TITLE: Emacs Configuration
#+AUTHOR: Alexander Jeurissen
#+EMAIL: frailty.tithing.0n@icloud.com

** TODO  Add visual indentation config similar to my vim config
In my vim config I added custom bindings to ensure the region selection in visual mode remains
so I can do subsequent visual indents with >

In emacs + evil this is not working out of the box either and as such need to be configured.
:LOGBOOK:
CLOCK: [2024-06-12 Wed 17:47]--[2024-06-12 Wed 17:49] =>  0:02
:END:
[2024-06-12 Wed 17:47]
** TODO Add support for gcc / gc comment motions
in my vim configuration I have the ability to comment out using the gc motion, or gcc for the current line.
I need to look if this can be configured with some simple elisp or if evil has some configuration for this.
:LOGBOOK:
CLOCK: [2024-06-12 Wed 17:51]--[2024-06-12 Wed 17:52] =>  0:01
:END:
[2024-06-12 Wed 17:51]
** TODO % in evil does not work with do..end blocks in ruby
:LOGBOOK:
CLOCK: [2024-06-12 Wed 17:57]--[2024-06-12 Wed 17:57] =>  0:00
:END:
[2024-06-12 Wed 17:57]
** DONE `*` in visual mode does not does perform incsearch for region
In vim I added custom configuration to make sure `*` in visual mode performs an inc search of the selected region.
I need to add this to my emacs configuration as well.
:LOGBOOK:
CLOCK: [2024-06-12 Wed 18:09]--[2024-06-12 Wed 18:10] =>  0:01
:END:
[2024-06-12 Wed 18:09]
** TODO add grep support to Vertico
Figure out how we can perform greps in the most performant way and see matching results in Vertico
:LOGBOOK:
CLOCK: [2024-06-13 Thu 11:31]--[2024-06-13 Thu 11:31] =>  0:00
:END:
[2024-06-13 Thu 11:31]
** TODO Read up on web browsing and following links in emacs
https://www.howardism.org/Technical/Emacs/browsing-in-emacs.html
:LOGBOOK:
CLOCK: [2024-06-13 Thu 12:42]--[2024-06-13 Thu 12:42] =>  0:00
:END:
[2024-06-13 Thu 12:42]
